Questions = [
	{
		"question": "Q1：一天當中，通常什麼時候你的心情是最好的？",
		"options": ["(1) 早上", 
					"(2) 下午及傍晚", 
					"(3) 夜裡"],
		"scores": [2, 4, 6]
	},
	{
		"question": "Q2：你平常走路的速度？",
		"options": ["(1) 步伐很大、頻率較快", 
					"(2) 步伐很小、頻率較快", 
					"(3) 走的不快、頭往上看", 
					"(4) 走的不快、頭往下看", 
					"(5) 很慢"],
		"scores": [6, 4, 7, 2, 1]
	},
	{
		"question": "Q3：和別人交談時，你的姿態通常是？",
		"options": ["(1) 雙手交疊站立", 
					"(2) 雙手緊握", 
					"(3) 一支手或雙手放在臀部", 
					"(4) 觸碰與你交談的對象", 
					"(5) 不自覺摸著耳朵、下巴或是整理頭髮"],
		"scores": [4, 2, 5, 7, 6]
	},
	{
		"question": "Q4：睡覺之前，通常你的床上姿勢為何？",
		"options": ["(1) 仰躺、伸直", 
					"(2) 俯躺、伸直", 
					"(3) 側躺、微捲", 
					"(4) 頭睡在一側手臂上", 
					"(5) 被子蓋過頭"],
		"scores": [7, 6, 4, 2, 1]
	},
	{
		"question": "Q5：做夢時的你，常常遇見什麼？",
		"options": ["(1) 落下", 
					"(2) 打架或掙扎", 
					"(3) 找東西找人", 
					"(4) 飛或漂浮", 
					"(5) 平常不太做夢", 
					"(6) 做夢都是愉快的夢"],
		"scores": [4, 2, 3, 5, 6, 1]
	},
	{
		"question": "Q6：當你坐著休息時，你的姿態通常是？",
		"options": ["(1) 膝蓋併攏", 
					"(2) 雙腿交叉", 
					"(3) 雙腿伸直", 
					"(4) 單腿盤在椅子上"],
		"scores": [4, 6, 2, 1]
	},
	{
		"question": "Q7：下列顏色中，你較喜歡哪色？",
		"options": ["(1) 紅或橘色", 
					"(2) 黑色", 
					"(3) 黃色或淺藍色", 
					"(4) 綠色", 
					"(5) 紫色或深藍色", 
					"(6) 白色", 
					"(7) 棕色或灰色"],
		"scores": [6, 7, 5, 4, 3, 2, 1]
	},
	{
		"question": "Q8：當你專心在做某件事，但被人打斷了，你通常會怎麼做？",
		"options": ["(1) 歡迎他，與他對話", 
					"(2) 非常厭惡", 
					"(3) 在上述兩者之間"],
		"scores": [6, 2, 4]
	},
	{
		"question": "Q9：當你出席公司派對或是朋友KTV聚會等場所，你通常以什麼形式入場？",
		"options": ["(1) 很大聲入場，引起大家注意", 
					"(2) 安靜入場，找你認識的人", 
					"(3) 極安靜入場，盡量不引起注意"],
		"scores": [6, 4, 2]
	},
	{
		"question": "Q10：當你遇到開心的事情時，你的笑聲通常是？",
		"options": ["(1) 類似欣賞的大笑", 
					"(2) 笑著、聲音不大", 
					"(3) 輕聲呵呵笑", 
					"(4) 羞怯的微笑"],
		"scores": [6, 4, 3, 5]
	}
]

results = [
	{
		"title": "內向的悲觀者",
		"range": "20分以下",
		"description": ("你屬於那內傾性格，為人比較內向，\n"
						"處事風格有些優柔寡斷，常常害怕犯錯誤，\n"
						"習慣自我反省，社交場所上會很害羞，最害怕麻煩，\n"
						"所以不喜歡參加不必要的活動，\n"
						"也不想認識沒有關係的人。\n"
						"情緒常常處在比較低落的狀態，\n"
						"常常以弟弟、妹妹自稱，\n"
						"希望得到別人的保護與支持。")
	},
	{
		"title": "缺乏信心的挑惕者",
		"range": "21分~30分",
		"description": ("你擁有近乎強迫症般的追求完美，\n"
						"有些類似於處女座。行事風格屬於謹慎小心型的，\n"
						"在一件事情沒有完全策劃好之前，\n"
						"你是不敢輕易去做的，\n"
						"這也反映了你缺乏自信心的表現，\n"
						"而且對於做事情的過程也很挑剔，\n"
						"不容許自己犯一點點的錯誤。")
	},
	{
		"title": "以牙還牙的自我保護者",
		"range": "31分~40分",
		"description": ("你的內心有著很強的控制欲望，\n"
						"有著對於周圍的生活環境一貫性理解的強烈需求，\n"
						"當環境有一點風吹草動，你就會非常的敏感。\n"
						"對待朋友非常的忠誠，\n"
						"而且你更渴望對方也能夠同樣的態度來重視你。\n"
						"你最接受不了的是好朋友在背後議論你，\n"
						"這樣會讓你傷心欲絕，並因此產生報復的心理。")
	},
	{
		"title": "平衡而中庸",
		"range": "41分~50分",
		"description": ("你的性格屬於中和性人格，\n"
						"為人有一定的謙遜姿態，但是同時有自己的主見，\n"
						"能夠理解他人，懂得照顧他人的感受，\n"
						"但同時不容許別人侵犯你。\n"
						"你有著很強的自我控制力，你下決心做的事情，\n"
						"一定會成功。很喜歡交朋友，人際關係處理的不錯，\n"
						"常常是朋友圈裡最值得信賴的人物。")
	},
	{
		"title": "吸引人的冒險家",
		"range": "51分~60分",
		"description": ("你的性格屬於愛冒險的人，\n"
						"通常大腦的思維非常活躍，喜歡嘗試新鮮的事情，\n"
						"行事風格偏重感性，只要自己覺得可行就會馬上去做，\n"
						"而且通常不計後果。但是往往結果會有很好的驚喜等著你，\n"
						"決策方面果敢而堅決，不會受他人的影響，\n"
						"愛情方面你總能給對方一些驚喜。")
	},
	{
		"title": "傲慢的孤獨者",
		"range": "60分以上",
		"description": ("你的性格是桀驁的野心家，\n"
						"從骨子裡透出來的傲氣，揚在眉角自信，\n"
						"很像是天蠍座或獅子座。但是你的性格過於孤傲，\n"
						"行事風格以自我為中心，很難考慮到他人的感受，\n"
						"在朋友間常常會讓人不敢靠近。\n"
						"你的內心有很強的支配慾望與控制慾望，\n"
						"你希望能夠得到很大的權利。")
	}

]

total = 0

print("歡迎來到菲爾人格測試！")
input("(請按Enter鍵以繼續)")

for question in Questions:
	print(question["question"])
	for option in question["options"]:
		print(option)
	user_input = None
	while (user_input not in range(len(question["options"]))):
		try:
			user_input = int(input("請輸入選項並按下Enter鍵：")) - 1
		except:
			pass
	total += question["scores"][user_input]

print("\n\n")
print("你作答完畢囉！")
print("你總共得到" + str(total) + "分")

def section(score):
	if score <= 20:
		return 0
	elif score > 60:
		return 5
	else:
		return int(score / 10)

result = results[section(total)]
print("\n\n")
print("因為你的分數在" + result["range"])
print("你的人格是 " + result["title"])

print("\n\n")
print("關於這個人格，詳細地來說是這樣：\n" + result["description"])